#### concat data frame

In [1]:
import pandas as pd 
india_weather = pd.DataFrame({
    'city':[ "mumbai","kolkata","delhi" ],
    'temperature':[32,45,30],
    'humidity':[80,60,78]
})
india_weather

      city  temperature  humidity
0   mumbai           32        80
1  kolkata           45        60
2    delhi           30        78

In [2]:
us_weather = pd.DataFrame({
    'city':[ "buffalo","new york","rochester" ],
    'temperature':[15,17,19],
    'humidity':[65,68,59]
})
us_weather

        city  temperature  humidity
0    buffalo           15        65
1   new york           17        68
2  rochester           19        59

In [3]:
df=pd.concat([india_weather,us_weather])
df

        city  temperature  humidity
0     mumbai           32        80
1    kolkata           45        60
2      delhi           30        78
0    buffalo           15        65
1   new york           17        68
2  rochester           19        59

In [4]:
df=pd.concat([india_weather,us_weather],ignore_index=True)
df

        city  temperature  humidity
0     mumbai           32        80
1    kolkata           45        60
2      delhi           30        78
3    buffalo           15        65
4   new york           17        68
5  rochester           19        59

In [5]:
df=pd.concat([india_weather,us_weather],keys=['india','us'])
df

              city  temperature  humidity
india 0     mumbai           32        80
      1    kolkata           45        60
      2      delhi           30        78
us    0    buffalo           15        65
      1   new york           17        68
      2  rochester           19        59

In [6]:
temperature_df=pd.DataFrame({
    "city":['mumbai','kolkata','delhi'],
    'temperature':[32,45,30]
})
index=[0,1,2]
temperature_df

      city  temperature
0   mumbai           32
1  kolkata           45
2    delhi           30

In [7]:
windspeed_df=pd.DataFrame({
  "city":['mumbai','kolkata','delhi'],
    'windspeed':[7,12,19]  
        
})
index=[0,1,2]
windspeed_df

      city  windspeed
0   mumbai          7
1  kolkata         12
2    delhi         19

In [8]:
df=pd.concat([temperature_df,windspeed_df],axis=1)
df

      city  temperature     city  windspeed
0   mumbai           32   mumbai          7
1  kolkata           45  kolkata         12
2    delhi           30    delhi         19

In [9]:
temperature_df

      city  temperature
0   mumbai           32
1  kolkata           45
2    delhi           30

In [11]:
s = pd.Series(list(['humidity','dry','rain']),name="event")

In [13]:
s = pd.Series(['humidity','dry','rain'],name="event")

In [14]:
s

0    humidity
1         dry
2        rain
Name: event, dtype: object

In [15]:
df=pd.concat([temperature_df,s],axis=1)

In [16]:
df

      city  temperature     event
0   mumbai           32  humidity
1  kolkata           45       dry
2    delhi           30      rain